[PAD]
[UNUSED1]
[UNUSED2]
[UNUSED3]
[UNUSED4]
[UNUSED5]
[UNUSED6]
[UNUSED7]
[UNUSED8]
[UNUSED9]
[UNUSED10]
[UNUSED11]
[UNUSED12]
[UNUSED13]
[UNUSED14]
[UNUSED15]
[UNUSED16]
[UNUSED17]
[UNUSED18]
[UNUSED19]
[UNUSED20]
[UNUSED21]
[UNUSED22]
[UNUSED23]
[UNUSED24]
[UNUSED25]
[UNUSED26]
[UNUSED27]
[UNUSED28]
[UNUSED29]
[UNUSED30]
[UNUSED31]
[UNUSED32]
[UNUSED33]
[UNUSED34]
[UNUSED35]
[UNUSED36]
[UNUSED37]
[UNUSED38]
[UNUSED39]
[UNUSED40]
[UNUSED41]
[UNUSED42]
[UNUSED43]
[UNUSED44]
[UNUSED45]
[UNUSED46]
[UNUSED47]
[UNUSED48]
[UNUSED49]
[UNUSED50]
[UNUSED51]
[UNUSED52]
[UNUSED53]
[UNUSED54]
[UNUSED55]
[UNUSED56]
[UNUSED57]
[UNUSED58]
[UNUSED59]
[UNUSED60]
[UNUSED61]
[UNUSED62]
[UNUSED63]
[UNUSED64]
[UNUSED65]
[UNUSED66]
[UNUSED67]
[UNUSED68]
[UNUSED69]
[UNUSED70]
[UNUSED71]
[UNUSED72]
[UNUSED73]
[UNUSED74]
[UNUSED75]
[UNUSED76]
[UNUSED77]
[UNUSED78]
[UNUSED79]
[UNUSED80]
[UNUSED81]
[UNUSED82]
[UNUSED83]
[UNUSED84]
[UNUSED85]
[UNUSED86]
[UNUSED87]
[UNUSED88]
[UNUSED89]
[UNUSED90]
[UNUSED91]
[UNUSED92]
[UNUSED93]
[UNUSED94]
[UNUSED95]
[UNUSED96]
[UNUSED97]
[UNUSED98]
[UNUSED99]
[UNK]
[CLS]
[SEP]
[MASK]
12
29
0
19
1
23
9
16
11
10
39
48
32
161
43
8
72
5
126
243
6
13
370
50
106
247
283
140
169
282
202
133
134
66
62
300
230
46
459
317
28
426
227
47
52
80
276
76
45
59
536
176
67
226
431
432
127
79
217
153
146
334
522
24
53
177
447
629
58
130
533
25
462
335
478
358
453
87
433
168
421
251
253
173
272
355
223
718
246
55
347
90
208
102
304
118
56
70
101
574
379
344
200
248
481
524
647
44
903
525
232
142
222
837
180
49
275
360
122
592
229
782
249
264
416
4
163
1006
444
485
725
254
114
120
941
33
107
221
68
212
128
162
518
457
263
882
472
89
213
422
192
464
451
42
172
159
35
116
565
285
193
115
470
307
800
1017
189
224
312
158
2
354
220
228
785
121
971
442
332
83
392
541
1188
69
135
86
34
117
108
209
456
342
353
365
348
1635
773
552
548
74
546
93
350
313
267
65
94
394
1053
252
813
553
3
92
455
345
794
41
336
215
781
606
698
454
295
14
1178
314
147
296
279
618
266
917
329
956
1124
804
571
1593
678
935
1195
812
634
476
495
338
277
250
583
330
240
406
776
311
646
333
380
119
767
390
1640
1525
1592
595
448
398
57
494
1259
366
331
1182
1130
434
461
1652
1475
1203
82
290
136
922
1661
471
191
75
532
7
652
691
1299
308
424
141
540
396
124
854
1097
692
440
274
309
550
302
657
535
818
1596
477
1277
31
1499
643
521
131
1311
579
1642
1290
439
40
499
819
757
526
473
236
933
1012
175
1310
918
260
594
187
771
73
519
909
1135
255
787
328
915
1024
1338
711
734
435
511
965
665
292
63
615
299
280
964
1555
1003
938
641
799
762
1174
1495
415
1002
1134
561
71
1032
635
1359
297
1347
853
707
137
337
1574
626
413
505
998
591
382
538
1287
138
2319
988
1236
132
291
949
1004
1425
736
1263
623
1104
1227
241
690
373
145
1329
1162
566
95
806
989
237
1068
1275
1759
852
875
178
395
190
1021
1645
2162
1584
1129
810
1644
1110
578
148
91
1364
352
37
341
889
225
389
233
1038
405
265
466
1319
361
671
1403
1430
705
123
575
881
1226
599
689
783
1698
920
1089
1192
1100
270
367
315
196
611
1370
1325
1426
2260
1613
539
437
761
1133
969
981
1431
1864
990
1506
2169
2643
1352
1051
1228
878
1648
1424
1209
239
1493
2641
861
612
828
1286
1789
483
919
675
784
156
1207
916
1536
1326
1101
862
98
642
2415
850
1497
1042
349
1512
1600
1125
959
500
706
808
397
403
322
662
1223
744
542
1803
359
507
81
1365
1121
940
790
829
1675
474
590
836
319
1619
36
1582
1732
1059
1556
947
1394
830
693
739
921
1213
753
3034
262
884
374
1570
468
625
1274
2351
1366
798
506
826
669
1397
1377
2420
573
945
1680
864
310
157
493
683
2006
2175
155
1231
1575
856
980
1667
708
393
1854
288
1993
914
2124
1160
1153
880
760
1522
166
1958
261
661
113
1847
77
1048
1249
984
20
651
357
281
2487
2089
1080
2037
788
1190
97
1450
729
1361
888
1085
1842
823
2213
1322
1027
598
99
1401
1649
1405
849
2538
1438
1107
1723
531
149
2909
885
2283
467
423
2066
895
2409
408
887
719
356
979
741
1193
1141
593
1132
2418
904
601
1568
3381
1491
64
369
2436
235
1239
231
1935
1507
197
653
1389
1794
1345
640
1116
877
955
1470
1496
1094
831
2434
1354
1105
991
723
491
1526
1786
559
30
2583
674
1760
824
520
1770
1440
1282
749
3828
1581
482
503
1758
817
1206
859
1903
105
1461
1235
682
644
609
1769
899
586
2290
1013
2170
1666
1245
2208
1446
822
1139
679
6604
1154
2483
1618
1934
1453
1087
327
1183
479
2229
942
1517
508
684
906
2636
371
1881
925
1466
1883
2879
710
1168
1170
1899
2041
1050
2023
3652
458
1610
1928
972
1136
517
1009
1184
412
1324
1276
603
681
740
2454
2113
1894
1660
754
2572
560
100
1822
2059
384
554
438
144
1527
928
2235
1333
54
463
2008
1307
1057
2046
194
381
2687
3087
1211
324
1022
2272
326
970
2000
2421
613
1208
772
1553
174
1918
672
722
602
1603
811
1476
2363
1868
411
3289
1701
3452
986
502
1210
1650
1106
568
21
2732
475
1479
1331
1990
1653
3316
1008
186
534
1001
1411
1534
2601
1383
1985
832
1328
961
1706
2280
873
3931
2047
15
1804
809
907
3173
1025
286
427
1332
4622
732
1576
1724
1562
1268
726
2056
2764
1415
977
1267
1518
3284
2779
2656
777
1763
1795
269
962
1047
2595
608
301
2820
3444
1545
966
4160
3168
1693
1624
1448
181
770
2613
759
1145
2210
1158
2067
3748
2460
1353
1832
2448
1622
1816
632
2612
2250
1054
497
1205
1665
2042
1877
1041
378
1478
2746
1092
897
1233
3604
287
3361
649
5401
937
1164
2197
999
2187
460
1063
650
449
2667
2309
1872
687
543
1588
1272
3917
2061
624
1295
4108
523
2191
1378
1500
2109
3062
648
2992
205
3544
486
1801
673
323
1787
1088
1948
2305
2030
2765
214
704
963
1808
1368
1323
2580
1095
2349
372
2328
851
3750
1445
1745
3105
22
1198
2536
2029
3171
2327
1739
3478
1201
1019
218
792
1559
3882
1780
219
2281
3329
2707
2334
855
3617
428
3026
1819
2198
2172
589
709
745
3013
1422
2945
614
1812
3253
2906
1075
620
2214
2347
1632
584
758
1583
3096
2799
1626
2116
1252
3092
1376
170
1696
1905
2269
216
1793
3270
18
2463
164
1995
1731
1643
1381
2615
551
1811
2806
2472
1913
3804
2069
1654
1851
417
567
2681
3271
1400
1412
1672
1396
4092
2181
179
1387
1647
1870
1109
446
655
1514
1564
866
2038
967
4942
791
1467
2996
844
4682
1045
1278
821
1128
2464
1219
1688
78
3639
2706
948
2616
527
1560
1651
3331
2192
1551
110
1011
840
443
3138
2471
484
1251
1509
1456
1705
436
2692
1728
2819
1685
4201
2600
2704
2403
1180
1037
600
2408
2111
1853
993
636
1058
5624
512
109
1684
1548
1300
3360
4224
2611
3492
3175
588
2244
1605
1829
60
795
750
960
3724
1421
582
3151
1163
939
1756
3402
1798
2121
1382
1379
1907
1243
3950
1802
1878
185
2105
1488
1367
2034
1919
1016
1662
779
1337
1664
1316
1123
2693
4079
838
6002
96
1186
1388
2357
751
1222
2126
2125
1473
1929
2655
2190
3669
805
6100
1852
2570
1072
2604
1501
2949
3308
1242
5531
1294
3702
465
1256
2828
923
2535
515
242
680
1636
2022
3116
2813
926
5238
1363
3641
2148
2289
958
2065
2885
1280
1577
2354
2918
1035
1839
968
2807
879
3954
1943
5249
1625
2864
2795
1998
2785
3479
1656
2731
2306
2317
4091
3714
188
2308
4262
1572
3315
4727
5553
3224
1330
890
2575
1200
976
1615
4207
318
1874
469
487
2401
441
1834
3885
104
402
3215
1248
2816
2470
1007
1699
3024
2176
340
1391
480
1774
664
2075
2679
429
5070
3701
528
8484
558
2122
514
1414
2789
2590
1567
2288
2346
2027
4369
4440
2114
4172
2080
633
234
2830
4891
1540
1547
1671
724
3041
3964
2320
2872
975
630
2988
2630
5168
1336
973
2407
1144
3016
1465
139
203
154
2860
2102
645
2177
5138
351
2375
4635
3162
2073
17
3761
1014
3248
1224
2039
1920
2555
1015
766
995
802
1362
3093
151
5307
1730
4681
171
5066
2873
1817
420
954
339
3141
3856
1147
2680
2405
2209
4468
702
386
271
848
4169
1902
1543
5257
2323
2356
670
2013
872
2546
2534
1049
5354
3204
3883
857
1289
803
825
3220
2098
4026
1747
931
2501
1260
2835
1520
1196
1945
2573
2304
1055
3803
3470
2343
211
2461
3738
738
2682
1302
4141
2152
2921
3620
871
1906
1788
1120
2776
3474
3543
3667
1858
273
1031
278
2987
3649
4226
3611
4355
1967
1954
1443
2174
1999
2769
1293
1061
3797
2527
1687
3431
2658
1996
3322
1646
2261
2107
1702
2513
883
425
2369
3829
3296
3135
4803
3498
3919
1321
1177
622
1185
2775
1023
3705
3815
1052
2316
2625
1142
1658
1835
4325
2912
676
4337
2585
2156
2178
3458
5325
1585
944
3351
1697
2119
1189
1857
4759
1358
2011
1283
715
580
4641
489
2540
728
3139
2727
488
3526
2115
4642
5986
2686
1682
2392
1398
3581
383
1979
727
2077
2560
1034
3918
572
2017
256
2282
2419
886
1513
1974
2117
4517
3032
2688
1484
1710
2627
204
2530
1549
4324
1796
1597
1676
2019
1118
1119
3747
2833
847
1904
4652
3766
5472
1187
1284
1468
3898
1994
4749
3074
2361
934
562
913
2550
5084
1911
1036
3760
1976
1079
1173
4175
1657
3129
2773
2866
1504
876
3978
2292
4596
2397
1515
3494
4338
2974
2882
953
2402
3588
985
1126
7237
1729
2728
160
3015
450
1194
2076
2108
3043
1528
4485
4000
3936
2745
3993
1150
577
5479
2502
1166
2743
4203
3143
4933
3390
3276
4420
1805
545
4206
1264
1931
4894
1748
2165
1462
1202
5808
3193
4858
4455
1240
399
293
1386
1212
4593
2845
2241
3343
2596
1897
3709
1181
4012
3250
3376
797
150
6461
2842
3055
4025
1464
1074
5158
2082
1070
2144
4986
8092
3991
2079
2449
3158
3608
1792
3359
1402
1927
2202
3123
2598
2984
930
2230
1791
5194
7106
7799
6237
5922
2622
3827
1709
4252
4015
2504
2801
2060
6656
996
5145
616
3612
2850
1342
786
2085
321
5653
501
2557
2718
5980
2777
3450
6030
3657
1617
4781
2626
2358
6755
1292
2135
363
5439
2355
2130
5772
2631
2232
1719
2574
3451
410
2856
3368
6269
1978
2839
1628
5227
5183
5312
5038
2957
2818
2979
2940
2291
3920
6468
3387
610
509
5203
4409
5178
3871
8400
4883
1452
1093
2332
587
4230
7043
4159
6853
842
3536
3525
4195
3378
3925
3027
1317
3726
6377
2074
5967
1637
5912
3370
1314
2005
3814
2548
569
3514
1146
4154
5198
6866
2610
5406
1715
1972
833
3757
775
2227
1503
748
1395
2007
1257
3481
2991
4068
2101
816
3897
4163
2994
2865
3056
4640
258
1416
2010
1221
2995
2224
537
1530
5965
1350
3659
1716
2757
4929
5105
5119
3902
893
6798
2810
3782
111
3502
6735
1220
1103
1602
2831
2676
4672
5948
1305
1463
1197
4019
4691
4454
5285
3277
3960
2146
4804
1046
4031
544
796
1833
1609
4728
841
563
2366
7558
2444
5037
1369
2333
2629
6936
2064
4136
1304
294
1814
419
4580
4834
3410
2053
4299
320
7538
1831
3112
2561
3375
5498
2567
7577
1862
1915
3535
1970
2301
5103
1762
1712
6642
1773
3860
6855
4204
1951
3154
677
4643
2892
807
4610
3776
867
4814
1914
2549
1244
5669
2488
2774
3559
1296
3614
5496
27
2694
1594
1655
1472
1115
929
4595
4314
3678
2142
5344
8494
2531
911
5787
4216
6926
3610
1946
3186
2768
5253
2973
686
4261
2511
1117
4964
3421
530
3578
2400
1895
2424
2796
7033
3183
8313
3052
6124
2143
2427
1563
617
1704
201
742
4110
3679
3100
4097
3340
3970
3708
4557
1230
2329
3499
1694
5775
1944
863
4229
667
3778
2532
529
1459
1309
1247
3783
1988
858
6647
4223
4552
1960
1516
3895
3306
4137
2646
4119
1176
7215
3675
2414
1523
3365
3285
3923
4558
6591
2876
4007
2952
3045
1159
3593
3070
2675
1157
1776
4758
4710
2938
3896
1298
1265
581
2647
2129
1521
1137
1785
7035
2763
3086
4537
2581
2740
1949
1566
1966
6073
2824
2173
2150
5255
2106
3345
289
1537
3625
1764
1741
2255
2475
1060
377
3767
6788
2437
2930
6306
3131
6955
376
3192
3083
4475
3417
4148
2841
182
596
1686
4028
3966
4027
1346
2805
2878
5397
5171
1374
4536
4326
5209
1320
3094
2533
1306
2904
3407
3342
414
5124
2412
3891
1544
2216
4122
2040
2138
2800
2246
3350
1711
2855
2969
5293
2478
1169
129
547
3927
4568
2399
3059
5059
1909
4503
737
2234
4958
5346
4149
3149
2455
1349
1532
3221
4746
4327
2447
5097
1887
5361
4471
4437
1840
298
3290
730
2826
4011
4456
2160
992
2315
452
3653
1573
1469
3995
1987
1175
5264
3242
3318
5324
1455
896
3672
3446
5988
3577
5757
3385
7752
3247
1373
4634
3217
6274
2869
4188
4146
4183
6843
4697
3722
2145
4164
3909
2411
4567
1225
1098
3520
4089
2002
2700
1451
3280
4977
3706
4113
1818
1498
6620
3716
2469
3835
2185
2505
2193
5473
2662
6736
3465
5311
4317
8605
2256
5135
694
752
5684
3515
2496
165
2374
2417
198
1722
2542
3830
2950
2849
3523
1335
9478
199
1417
4046
1408
7984
1077
4258
952
2295
3512
1229
2599
3405
4704
5910
3676
4902
3790
2423
5382
5036
1266
1820
2670
2695
2568
1138
4111
835
7038
1713
9053
5665
3655
2690
3210
8145
5991
2297
4766
2854
1790
6177
1390
1056
2651
4909
4227
2299
7330
316
3503
4249
2547
5300
4648
3014
3127
2720
3362
2179
997
5250
4003
4849
860
3729
4416
2243
2221
1932
1669
2298
5573
2467
5058
1474
7762
3969
5132
8277
2609
1815
3983
4474
4630
3519
1800
3755
1533
4033
1083
8672
5334
4282
2515
2597
1612
4219
1923
8671
3834
1084
2338
3176
4106
5467
8040
8656
2617
5628
3946
4861
4478
4231
1720
3002
1940
3022
2770
1372
2396
2336
5336
5456
4374
2204
2558
2099
1844
4824
1460
5231
2787
3075
7898
3961
4237
5200
3893
2429
3576
8561
3943
6638
2691
6142
4058
3159
6967
2223
4187
2715
2937
4524
2966
4600
2267
1091
5268
4523
5396
1407
7451
5142
4278
8486
3765
3363
3916
3661
1981
5125
9990
103
2051
2508
3119
2954
5275
3924
3505
2476
2240
1237
5995
5705
6824
2093
4831
8244
6364
3545
1114
5013
2908
2104
2577
5120
2247
5878
5144
3723
3529
3251
3037
5652
8197
2164
4618
5702
5776
3126
5900
5884
5733
6017
564
5441
3432
6474
3218
10386
2055
2497
3009
5555
3044
2753
2394
6132
1315
2998
2158
4236
8137
6496
7527
9583
1890
3327
2618
3743
7394
6021
4565
2525
4636
4743
2090
1933
8657
1876
6418
6122
3161
3416
5906
4666
5267
6825
5516
3211
4288
4099
5712
2628
1579
1281
5137
1880
3025
3994
7931
11182
5014
8832
1879
6563
3562
3099
8525
4860
2744
4628
3504
2594
4269
898
4494
7871
1726
4241
9268
1542
3050
3589
3257
5403
306
2838
6160
5252
4644
2642
498
7768
5333
6564
4868
8885
5961
1746
4919
5197
905
3433
3461
2539
1633
621
2747
2307
6022
4665
3071
1318
7445
7721
6473
6823
3484
1959
3775
1505
112
3666
6953
2432
9964
8463
6298
5095
7077
2321
3940
1962
2976
7468
2524
8875
5415
3078
4220
13793
7113
6633
6765
3229
4002
5600
7495
6574
6749
4602
4447
3241
5540
3643
8259
3200
3232
4806
1392
5642
6069
2678
5251
9790
2788
1343
7193
5071
3406
9050
2521
685
1734
8928
5872
3364
2725
12603
2870
5830
6475
3976
1270
4124
5395
2798
4992
2134
6472
8304
5471
5949
6519
4501
5054
4247
8181
7211
4930
3441
3330
5299
1111
1678
1884
5093
6969
2044
1953
2009
4879
5928
9196
4268
9307
3670
5588
4762
3079
5237
1546
10186
5179
2724
6412
4359
3740
5323
4656
7478
1040
2868
2092
2985
4818
5908
7173
3922
4981
4331
10004
2944
7760
5306
513
4074
3122
2633
912
1490
3866
1718
2031
927
7986
2217
2578
6129
1871
401
400
7264
7603
5718
3838
2978
6776
1623
4162
6137
7521
7354
3170
7320
4418
7337
6434
4289
1980
5567
2891
7569
5221
4931
7519
5974
3741
4910
38
6442
4915
3118
2491
5270
2492
4736
3928
3817
5330
5434
2390
2832
4983
5958
2452
3982
6384
4107
4731
4464
3524
7681
3243
1269
2410
4570
3988
1683
8085
5026
6615
2045
9785
4061
10950
2222
9106
4056
4789
2556
3816
4859
6003
5459
7081
2377
1753
5101
6033
4473
5511
1485
6140
2886
7100
6261
2484
4678
1039
5222
1634
9303
3166
4144
627
6435
8224
894
1629
5707
3962
2495
1442
5856
3574
4673
3957
4711
2893
4790
6597
3662
3272
2003
735
9223
3177
1434
4936
4291
2258
3713
5596
6370
1692
1148
9352
2054
5129
2188
8903
10966
4342
2759
5294
1428
2947
1901
1971
2760
780
5216
5738
9673
4896
4062
6722
2252
8601
8456
2091
4650
5505
7679
510
3693
2155
3735
3949
3089
716
2640
1355
5210
2071
7448
4360
6098
9695
9935
902
5804
6203
6719
2989
1487
3403
5384
2825
6958
4024
2458
5964
3188
10110
5931
14921
4535
901
1271
10885
3727
10526
11527
5053
2710
3663
4145
2843
3313
5875
4070
5389
6293
846
1856
1968
4963
5460
1535
7858
2433
5627
2490
2591
1885
10397
5417
5430
3299
3665
4170
7975
5283
3590
3552
555
3872
4302
663
9607
4645
4534
3563
1639
8717
1969
4726
4657
418
6627
6343
206
2120
3945
2920
4791
6019
4984
4979
6846
5566
8952
4932
8321
4023
5149
1779
4445
5188
6482
4625
1086
6652
8980
4413
1096
5667
5431
2859
4793
4647
3373
7682
3397
11991
3430
3264
5442
1437
4773
5785
3531
3332
5488
5313
4895
4010
5232
3844
7749
1837
4021
4295
2014
5490
1449
7298
5571
7240
8618
4794
3082
1778
11739
7974
5655
6133
4482
2303
2462
3031
1420
8774
5752
4452
1939
1399
6094
6848
1750
6801
3718
4527
604
1638
8118
4893
892
2896
6031
6949
7823
2672
2736
7388
4444
5748
1781
2128
7856
2364
7177
4080
1149
3463
4460
5060
2657
5809
6155
2953
6248
7805
3806
1018
4088
3560
7089
8425
9314
10074
5380
4800
2804
7667
7827
4735
9273
6196
6739
4419
4391
5502
839
5494
11557
7833
9934
2273
2340
6162
4901
5069
1810
6362
5260
2735
8423
763
10212
4890
7454
2739
1825
6947
1216
8098
5147
7108
6411
10077
3739
6156
8131
5865
8153
5295
5620
3185
4020
2153
6763
3603
4677
5245
3228
4907
10125
2477
4518
10579
2562
5577
4787
6040
375
3637
6950
1721
9325
3268
3959
7604
2738
5463
1510
1910
4613
3302
3304
4795
9046
5088
6667
2834
7484
3972
5896
5966
2541
4661
4451
3036
6081
7317
2786
4052
6270
6446
9618
2791
10382
2422
7991
4313
6291
1161
7574
4724
4801
284
9564
6764
3483
2722
3613
11301
2296
4050
2205
9595
6547
11370
3117
4836
1921
8436
5625
4117
2342
4823
6356
6635
2582
6703
4968
557
7691
2163
10366
303
3019
6921
6135
699
619
3256
8360
7631
6144
7369
5694
2226
3752
7129
5537
2587
1447
4259
3382
1454
10133
4415
4234
6767
2916
9228
5793
7325
5445
4914
8227
7660
5034
3533
3958
8138
7274
2929
10997
7892
7649
8523
5254
4109
1301
1393
4472
5629
8200
8322
2621
9408
2780
2088
4152
8107
2821
2137
6929
5765
4867
5155
2300
1866
5889
1843
2456
703
1668
3424
843
5547
5219
13219
2632
6456
4973
3209
2589
1888
11804
6174
6192
4356
7086
4546
3728
5356
8906
4350
2139
2889
4528
7311
3813
3930
2103
4273
868
4083
5672
1327
4382
7761
4168
1413
4881
5818
2206
5452
6450
3292
3466
4685
6009
1984
1043
712
5959
6570
3010
6598
368
6571
4405
4880
7523
4208
5475
9904
1963
5030
9619
8584
7841
5409
5930
2441
6651
6792
3372
7553
4496
7114
2018
5962
6315
3314
2936
5984
9769
6184
7406
2277
8951
7220
7278
6636
7759
8013
2473
7194
5225
3366
3357
5747
5528
7639
3231
6151
15311
11613
9664
8380
4507
3377
2840
6706
8646
85
4737
6342
951
4821
9961
2665
5762
7150
2094
2881
6839
5393
10667
6109
10752
2669
1916
8252
7738
7725
1809
3146
3028
5526
4380
5480
4132
12291
4053
2797
6902
2284
6838
1344
4085
2446
2778
1850
4287
5853
6292
8233
2507
1489
10439
2999
2808
3004
5648
6007
4748
9318
5067
5679
2741
3820
5518
8216
3469
3753
5744
1531
3437
5243
11236
6504
4103
4855
4659
6710
2901
12735
4693
9266
5368
3367
778
3973
7202
4780
2606
2792
6016
1896
6454
3825
8077
1873
4329
7535
6756
2371
2020
430
1483
3846
14071
4004
3312
4938
10477
9482
1766
7226
5968
8674
2608
3455
5850
3886
6271
3203
1385
4761
5023
3656
3819
3600
5810
1580
7078
11118
7748
6035
2871
6922
697
3550
5940
4279
3549
4332
3971
3770
1775
845
6625
5890
2961
721
5538
9211
9796
10318
4978
764
7395
7605
597
6673
4852
18397
11082
6471
12312
2249
6464
3267
4843
5024
5832
1867
4489
9027
6467
6431
8902
7855
7301
7767
4560
7007
3564
1529
3929
2036
5297
9977
4937
6957
5701
5919
9263
8215
8940
3225
2803
768
5140
13131
4476
2981
1926
5506
5007
3254
6301
7246
12203
8976
6289
7872
8920
5424
5143
6438
7842
2650
2425
3485
5345
3434
3125
3510
4792
9941
8116
10782
7065
9152
5891
8292
8820
10878
7702
10462
1595
10207
238
11023
7322
5404
10242
3737
125
14442
1777
11174
6909
7897
2182
8164
6479
1631
3582
88
3467
7118
1000
3195
6320
8434
3548
2465
8035
6316
5546
5527
7528
9532
7328
2652
8476
2614
5847
3754
6916
7930
2025
6365
7583
8114
3894
4428
6708
6488
6423
4480
8422
4813
4987
3088
362
4615
5080
3648
10211
576
5121
1681
6827
7218
1737
2068
7877
8872
6273
2350
3039
659
7306
2946
5522
9448
9692
3584
8440
4723
2664
3887
12722
4458
6253
3490
6366
6569
10148
9721
1471
3682
6227
11027
5914
8729
1565
1836
10290
1925
6956
720
4421
4101
12033
5883
5113
9440
2607
4878
1254
3585
6506
6821
7489
2489
7205
6671
9622
5090
9774
6169
8846
9669
3219
4579
2238
7256
8417
7602
9172
5639
5033
4417
9151
15489
2552
10941
3572
6992
3686
6449
5513
7405
7374
7657
6115
1620
4426
5436
7190
5802
3989
7473
5416
3878
5926
14486
8016
6832
7267
4815
4783
4663
5799
6112
8071
9026
5184
6141
5259
8110
2721
4323
7588
2386
6138
3412
7925
6937
8246
1384
4940
3338
1673
2564
8325
6600
15029
6052
3422
8609
10067
2965
2380
3541
3715
7878
7345
5193
8688
5924
8796
4510
5985
7048
9612
3230
10668
4714
6660
639
607
8217
5550
8575
7825
3537
6405
1165
2645
6809
11325
8677
5923
10478
6116
4171
5708
7924
10213
7285
3081
5944
4093
1659
9893
2372
7628
3542
3132
3336
2498
9933
8826
8576
1081
4514
8132
6063
5622
1900
2500
6903
3098
7115
3628
2593
4706
7039
2637
3163
5971
13773
6966
2737
3859
5083
1427
1482
15198
3061
8967
957
4835
6552
12327
6623
4961
5982
11549
10109
3374
5806
2827
2084
6286
3181
1738
3507
3736
4886
4768
4051
5904
2772
6079
4586
4044
2445
3199
5510
1557
2762
8416
3395
4098
3583
2352
6277
11705
9213
3567
3635
4005
1179
4922
2708
5788
6831
7715
12034
10695
4620
5671
6544
4345
5976
5288
7236
5279
11084
4408
8647
7253
2140
7393
4764
2639
9475
10796
5117
10587
7625
4591
5946
10944
2482
7591
4156
6512
7499
3807
5111
2440
10911
3937
6149
10048
6646
7798
2592
4785
3259
4763
6297
7571
14524
6973
6761
2705
8540
4660
8691
4410
10261
6204
5633
5770
7817
9911
7466
6686
6005
2166
2848
8418
1898
3905
4832
4462
4829
3877
5545
6820
4078
4994
2586
585
6643
5081
6130
5096
4271
7042
6440
3300
870
4624
15859
3164
8235
1725
7531
3809
6311
7704
4490
4368
8349
2703
13417
4540
5807
7990
1255
8622
9101
4388
10059
12783
1561
2510
6024
6397
2233
7475
5901
6441
4448
1404
2663
10466
6439
6013
6043
5777
1689
2287
14118
1508
3565
714
9787
15104
4985
11441
2522
4884
3033
5476
8281
5563
6976
7606
4796
8251
7136
2648
8865
6245
5862
1113
5207
6459
2654
6530
6355
5228
5734
7500
6389
1827
5969
3414
11891
10744
3951
11594
1824
7409
5515
3522
10831
10171
3237
7945
10607
6517
5487
7166
4246
6699
7338
8125
7607
8420
7621
10197
5942
5320
6803
6338
8510
5385
6629
6906
7418
5273
3003
3822
9019
14635
9822
7696
7593
3419
2649
2520
4125
1131
5827
5016
7248
13165
9502
2793
8918
3182
3196
6961
7258
6242
6891
8042
2330
13342
5322
7231
10560
7036
4039
6861
12068
12972
3187
3007
2702
7105
3213
3798
4911
8142
11534
10009
7102
5341
8482
6696
2451
11062
8388
6971
8999
2771
5562
7286
8411
12907
11349
7435
7867
9065
1598
5139
3156
4319
11629
5265
8372
4264
6712
6166
11956
6779
3399
2802
9491
10546
9108
1029
9646
1961
4520
4438
9840
14104
8075
8234
14177
4956
6864
9797
8461
5780
3985
3060
6278
4399
6367
5272
7665
9443
12622
8710
8754
5050
8441
4667
5934
6954
7522
17940
6123
4214
6304
12629
14978
6690
3785
5465
7444
9989
7262
16389
9183
2543
2602
3638
1480
4755
4009
2348
8012
7776
6341
5716
6325
5605
9289
6674
16146
5466
2218
10706
4361
7029
2376
7946
143
3532
1821
7169
11790
5413
4611
2754
10961
3427
7104
4845
5319
6363
7004
12079
6118
6324
8848
4063
4221
9285
2846
12274
1608
3826
1767
3802
5557
16284
7826
7157
3341
4072
10511
9699
5994
6555
14667
5468
2302
2251
2815
4671
6796
7223
5314
2923
6596
8382
5074
2388
6299
3509
4321
4989
7344
7413
4173
3855
5154
7459
6185
13278
4846
4387
14190
5448
3690
7714
8203
6883
1288
6845
11657
3104
6053
3080
4383
3965
9674
9558
8283
3018
6085
1238
1441
3521
4385
1950
4569
7619
7358
5591
14601
4553
3239
4923
6580
700
2279
10430
2857
8003
8394
6455
4928
10646
7116
3892
10056
8545
3460
1340
7982
3501
11840
407
5541
6854
4844
2035
6757
5477
7662
3786
6540
9672
11474
3645
11355
8477
9675
4189
3260
3500
10959
3206
3913
4955
5390
4607
6244
4059
4786
3201
8675
8732
3906
4585
5695
3935
9945
10029
1599
5358
4463
8022
4974
3233
4424
756
3273
696
8469
12425
9779
6172
6004
8177
7011
7181
12192
6724
8731
12076
2671
6332
8568
9780
8763
2537
3694
4270
12501
8232
3326
3640
7250
3719
257
5211
6136
7299
12088
4143
11166
1952
6465
1152
3626
8358
10003
10032
5871
6789
13327
10438
10795
5590
2874
11177
1578
8989
8121
8509
2257
5831
14770
7934
6634
7075
10853
7843
10739
3486
5790
2528
8889
8670
7470
6896
7350
9182
210
13842
5359
8333
8842
409
9801
9825
9407
8569
11094
7381
5481
3145
10547
8934
7541
1494
4559
9049
259
7030
5658
6051
2057
17365
10017
3005
11129
11832
3136
7419
5710
14825
4533
6868
8083
14367
4121
4114
10531
11197
4718
10710
2823
13167
2154
8698
5662
8640
3287
6594
5603
13061
637
5608
4892
7308
11292
3435
7062
6511
7428
3111
7006
2220
11817
11010
2877
6222
12260
3021
2259
3227
5499
6805
7026
3262
6254
2024
6818
4662
943
6734
4581
6721
8795
5833
9161
5449
2062
5374
3599
207
13146
3369
14510
6793
492
3371
11198
14985
12764
11318
14015
9238
1586
2381
6437
11901
6962
5443
8958
8089
10492
7876
4753
2875
3475
11607
10906
7688
5517
5615
1955
4470
3457
6060
4574
3956
4590
21207
4495
3058
8210
3160
343
12402
8824
2544
4917
6865
2971
6379
4449
9313
9190
6197
16134
8061
2004
6572
5758
3153
12200
4180
6218
1339
8990
8324
4513
4176
12316
9830
7479
5486
10433
8341
3780
2684
9040
10107
2285
1983
3380
2149
4037
5047
10620
3440
2959
8810
8102
2133
2917
12477
11940
10226
8431
4998
10549
4707
1860
8858
6329
12053
9033
5800
7764
7318
3787
1590
13553
6748
2245
14197
1436
11849
17024
3595
8711
17274
11187
5720
6011
1733
6092
1908
7529
5195
4875
9320
9245
11297
6869
13518
11788
6911
26
12464
2565
7958
5508
5993
3805
13555
5915
8592
9449
5242
9321
1744
4812
13878
9150
4699
7579
4064
11727
3346
9242
6672
3699
12838
7357
1641
10265
4087
3278
5239
3067
5303
8312
3066
14175
11412
8991
6910
1765
12346
3068
6077
6422
2345
1826
7537
7294
2171
7775
10983
10124
5483
7074
2956
4774
9507
3695
7514
4605
10616
8298
8393
9708
5318
3703
7772
8548
5882
2395
12254
9824
6999
4808
5597
1078
8124
3384
11921
7216
4402
15300
3908
9848
14246
9623
5339
6648
4497
7243
15342
14802
9304
4186
8179
9113
11814
7234
2863
4947
2677
3396
9814
7739
6014
1524
8839
16322
3808
11981
3941
6945
20531
10751
4840
1849
4341
10727
11339
3235
7942
7724
4129
2384
10064
4032
3939
11047
5001
11046
3095
5544
3420
9427
10377
5925
6287
1589
9986
7734
15314
3684
8922
9634
18999
3489
7340
17654
7032
5258
11555
14944
6587
3914
5246
11440
10557
6978
8257
5609
7686
1601
1947
8665
9881
4638
7458
7295
4185
5640
6361
10296
12915
9616
9776
9719
13833
8316
9257
12865
9218
8460
9093
1375
8296
3266
7041
12447
15503
2685
5372
16231
14330
12504
5048
10550
7027
5020
8741
6191
6428
10072
5391
9157
9514
8687
4857
7178
11330
15207
13941
8588
3794
14216
2900
789
2168
7412
3298
4179
2457
3842
8792
9767
3998
4548
1108
5201
11125
2529
9060
5619
11381
4022
9158
14096
4740
15494
13719
4081
11717
10592
6107
8870
7197
6862
3692
13205
4134
17196
4376
10975
12388
6557
11599
5860
6927
1492
7266
3942
5664
15010
12399
3602
5713
6933
17208
7438
10669
7188
10730
4307
12813
9542
713
2389
2286
6147
15727
3493
7592
8876
12147
7554
4465
7801
2136
2481
6523
11625
5866
7098
5440
3258
7363
10436
9144
5829
5532
9755
7695
8806
5230
9199
3768
7795
6188
3547
5717
2955
3404
2634
7255
9718
2468
7868
2584
6093
4155
7812
7957
9279
9626
7585
5357
3818
10285
244
9994
2962
1253
16660
10806
13441
6582
2459
8161
9333
15268
7584
5703
2817
4242
8930
7235
4732
1991
8756
7627
10362
2311
12225
9252
2001
5500
4639
13284
10574
10255
6150
1090
631
8315
5730
6256
17549
1371
834
12348
7151
8495
3121
8886
11875
3977
11448
10890
9310
5224
7174
7911
5840
5247
6840
5046
5457
10858
7951
8343
8797
3869
10142
2215
1938
4275
3179
11978
2928
12361
6114
10312
4240
3339
5812
4651
4395
8565
1761
8659
2268
2673
13821
10400
5495
4547
6020
10306
21989
1838
17495
5691
17382
2416
1171
8790
15940
11185
7110
6753
404
12773
6381
7440
9186
6382
3952
10158
6148
7359
7852
6783
9656
7950
17918
2365
5110
4770
3763
5192
10596
15221
9637
14977
9603
8150
9962
3876
9942
14687
10369
6535
11686
13902
3281
7830
2157
4105
4805
4670
8854
11562
5355
6161
12469
5174
7670
7797
2431
13339
12491
7612
5877
11591
3884
7398
4854
4304
1360
1064
3658
14934
6457
2701
11333
1714
9428
10854
7402
9494
9834
11472
4467
6340
9969
7090
6349
11215
5420
9056
1258
9274
7587
7334
1893
16444
1736
13972
5042
4104
9697
8547
9739
6241
8750
6158
3845
12920
9334
3279
9799
4874
5082
20971
7436
6549
8781
18137
9778
9412
14188
10254
9819
8898
5461
8094
2902
8376
3707
7983
3076
2588
7880
4683
2087
10028
4869
3214
7658
4967
6099
10659
5208
6828
12352
10061
16901
12111
1922
6741
5160
10716
1735
10160
6152
11928
7095
3875
3762
3992
9960
7082
7927
9256
7601
8648
10707
4572
11022
11950
8935
7010
9005
11731
5383
9995
18116
717
6308
5863
4519
13946
5104
3974
10082
14817
13916
5536
11382
6802
3234
15053
12565
10703
7561
7054
3553
4339
13964
6781
7518
11425
9817
10799
12745
10801
1127
8256
6684
3321
10305
1030
10127
1571
12649
9394
4166
5386
6380
6181
9838
5696
6983
11989
4856
9224
16881
4705
6170
12106
11243
14928
9483
8168
8993
12944
11242
6727
12639
1308
15216
9768
5721
12271
8424
2661
5005
2982
9574
5202
6171
12197
14130
2359
5256
8430
6337
4825
10647
2264
11443
10364
4135
3554
6885
9773
9104
5109
8303
5815
11675
2717
13962
8508
13493
8444
9215
1279
10279
10683
8088
7185
5858
9979
12714
12508
9597
6392
8595
12468
5410
8929
12861
4358
3773
6952
6518
10419
7719
9541
4153
7916
2406
16431
4386
5166
6462
4646
5478
11272
9175
5176
9080
7279
7890
3252
5651
13811
15683
891
7520
7613
6794
7225
11508
6360
10735
5975
1246
13706
7008
14053
4946
5086
12311
9290
9014
6006
13645
9981
9426
6067
2382
7001
12998
8503
5604
11967
11404
5387
8318
7244
9789
14611
12009
5711
14523
9988
5732
8813
8911
6500
4684
4301
10405
3447
7424
18487
11342
7228
1757
10078
10601
1143
6224
5173
6221
3934
10371
8401
8708
13918
2862
6562
2905
8863
7883
13395
6101
8689
9169
7314
12640
4709
9859
9748
4336
13712
2569
9180
9535
4897
7576
183
2968
10314
7482
8144
5911
14625
14152
18856
15038
7733
2072
2353
946
7072
2167
3317
4492
6595
9720
7511
11679
14519
9599
5378
7163
6285
3293
4076
8693
4538
4688
7533
8331
4243
8374
7474
4191
12769
14889
3674
6319
12774
11092
7822
2242
12855
8684
2970
3471
2730
10246
6732
9111
7938
7507
18433
13581
10152
10231
10918
13747
5987
5376
5634
4429
14248
9434
11399
9409
8275
10655
6568
10980
7201
6541
19569
8850
8067
2231
10230
4820
3944
13227
6183
15668
14434
11311
7835
6661
9446
4286
5614
3587
9707
1312
10157
3301
10651
8049
2660
9999
695
10930
13662
10642
1700
570
2254
2132
13832
14144
6691
3480
5864
12301
8278
11673
3511
12482
1691
7000
11496
13503
4248
8942
8149
21762
3497
5051
5743
3282
20996
19618
1989
5156
13047
10898
2368
7101
15333
6190
12051
793
14004
6991
14205
3124
8109
5700
2398
9529
3398
5022
9264
8787
5846
12276
7018
15797
7287
11745
5978
12729
9554
13533
5935
1313
5938
14403
4745
10327
4008
6427
10867
936
3150
9865
8034
4126
7572
4030
3085
8155
6575
5248
9794
10076
10328
5673
9235
4637
10617
6510
6352
6876
4531
9568
5041
14312
9685
6249
9206
12151
10154
5161
17518
5052
7257
7282
14037
10137
8957
4477
7906
18056
14241
5825
11768
14288
6267
8682
15187
4549
11732
4397
2698
9523
7616
7777
9330
7828
5027
7159
5763
3008
7703
9880
5432
9920
2814
4217
7307
10385
4696
6830
8011
9115
3557
3508
17771
20950
12759
5296
3344
3269
2276
13983
6231
6935
12866
6681
4038
15124
5408
8611
6797
11519
7793
15974
3516
2081
14123
10926
6688
11361
3137
10984
11075
15843
5276
8123
11896
3874
15519
12077
13196
4362
1930
3851
12078
4853
4674
8428
7661
5214
10863
11816
6668
7014
8921
12931
11734
9121
8435
12256
9102
5474
3320
6870
6283
12179
2196
22626
8761
8357
8379
5857
12971
6335
3415
7289
3824
7806
2714
4798
6558
4767
6102
12461
10333
15237
6087
4257
8014
5569
7815
13183
3987
3630
13005
9471
12678
4616
1511
3029
9852
8643
12497
4545
15373
8182
13436
8723
9723
20316
5575
8749
6039
7449
15068
10214
3558
5512
11176
11143
5774
11059
5678
3167
12052
13892
9437
3979
5064
15921
4322
4690
6072
6048
8562
9759
12996
9983
2907
4330
8563
2370
10803
10331
5951
9401
5226
5839
7453
13870
22379
6145
11286
14980
4205
10936
7059
3347
2888
8159
6723
8721
6219
8036
10876
18977
12749
7997
6965
4102
6215
9332
2263
4658
5411
5937
12136
5278
7754
6037
4582
14972
12974
9751
1841
10408
13347
7838
11315
14459
4140
4675
8404
6492
4566
7684
6709
20041
3072
2623
3880
11583
10498
5754
9419
2603
18262
15164
10453
12066
7622
8408
4086
14673
10014
4285
10937
17118
6103
9452
11473
10807
3411
6394
7620
5972
1291
6806
10775
7057
12544
8008
4668
7209
11227
6725
9032
3848
6333
10103
7378
14372
11882
7443
22836
1151
8384
15784
7654
8585
18264
3907
12178
10085
11165
2867
5817
2766
12788
2861
9214
13681
4777
4632
6436
6413
6837
17227
4976
4292
6451
5509
5308
10823
10071
5433
5769
12601
6402
13176
6126
7022
8961
5947
3223
7420
9684
3048
6683
5450
9278
9959
14153
13987
9058
11130
6376
13251
7431
11006
9888
12964
6110
11071
11253
8009
4483
8405
16852
7293
7015
9312
5824
9512
3671
2379
4561
3476
16048
8317
13636
3155
5428
3038
7755
4228
17160
5453
9171
9450
10724
8475
61
5989
7902
14449
3677
6529
13932
9921
3901
6502
16451
6524
10166
11779
7051
14432
3873
5895
6463
1357
5340
12848
6153
14697
7323
5572
4133
10639
9509
12127
10870
8006
6374
6932
8974
6669
4694
8938
7774
3650
11313
10522
14224
6032
6731
2566
12718
19051
8122
3636
18669
12688
13453
6692
10861
7360
827
4375
12014
11507
7019
11111
11797
3812
7490
8187
3777
5876
9176
2837
6617
13732
7596
11140
15717
7590
8201
5641
6626
6117
12120
6599
10656
8888
5687
7783
1607
8293
12159
5849
6408
2951
2435
3551
152
16375
12472
14606
3568
10189
6815
10886
2579
12862
20274
8001
8994
9923
11199
16056
13526
7296
14731
6300
12231
10935
13421
1010
7859
9546
11602
6433
5936
19992
7131
6236
8881
15539
1112
6585
9145
2659
6317
5801
8604
15067
8344
9757
9142
7955
13574
17416
16941
10600
4404
12390
18443
9221
10063
14709
14514
15040
15557
4599
5661
3324
15209
14427
7549
5892
5133
3459
9833
3047
16345
9582
19969
8607
5213
7122
12654
504
6754
22262
7578
3429
8294
3528
11735
11476
7969
2668
4903
8359
10484
10092
2207
21740
5798
7277
5321
8051
15671
13550
3152
16735
13548
9882
908
11009
9590
4900
900
10316
9704
5381
5761
5375
5187
7536
17494
10927
12857
6080
13952
10625
15979
18520
2750
3601
13236
7403
10838
13889
5692
4664
11630
10363
4351
16971
11054
7276
12852
10713
549
7263
6350
3283
9133
3358
8367
11156
8573
14859
14142
8231
6373
1924
11426
5019
18162
7751
4411
7850
10813
1261
8706
14378
4303
8383
18236
6816
6924
9738
2576
10485
10141
1727
3837
6313
12537
11884
13199
9624
15485
24773
5447
8521
20836
13650
8399
12895
10193
14782
12428
4212
7566
3408
25564
8459
11678
17077
11108
5127
15138
9410
4725
8744
2913
1823
6089
9372
8587
9095
10361
8805
9219
13587
9522
10187
14067
1569
12830
11523
18696
7382
3555
688
10810
9461
8681
4935
12562
10597
11220
2964
4401
3428
4700
5766
7300
4178
7568
8457
8490
3997
5686
18081
9858
14580
9129
12926
17607
11119
11471
13710
10780
3198
10630
19734
2975
11250
8335
2742
10883
12289
14261
13490
15251
6586
10758
8101
2373
14599
4779
11387
7271
6645
15836
2751
10650
6553
8471
7962
6775
8625
8505
10653
15149
15225
7259
15178
5637
10996
4562
13879
8512
11694
14356
8794
9326
14596
8478
14550
1865
12812
2339
6899
1066
7450
11183
17760
12081
11310
13105
7818
13590
1429
7055
6104
18712
7782
14513
13826
12786
16614
23018
1334
1486
8602
14920
8038
6707
8652
7979
14875
14702
9887
19548
3409
6268
2184
12114
8932
5134
4588
12717
13051
10264
6061
5190
9293
9657
14641
6737
7469
13696
10144
4218
6086
7183
10880
3172
184
21002
5343
10329
10388
7463
4139
4889
5315
13361
10134
7970
7171
4344
10167
6858
8829
12258
11196
9296
3879
746
5122
8759
4250
11582
16070
1552
4577
5855
6554
12097
6872
7471
8836
19439
6664
19021
8873
14113
12368
5087
3488
1554
7097
15985
2523
6584
12071
7674
7901
6088
13430
16265
9926
8927
7666
9368
11913
6938
5427
8856
13299
8479
5316
5220
7153
16721
4067
6194
8804
9760
15142
8120
13679
9640
12150
14180
9895
4095
8593
9355
9283
14415
13847
9857
19918
12651
12532
6054
10237
1611
13677
10564
9598
7689
13160
10993
11097
3732
994
11813
5617
9191
2519
7642
10559
15715
7172
4198
13822
12591
10943
6296
16966
17456
21967
11541
16598
4905
17997
13695
9254
23640
6357
4888
22609
22059
7567
4729
6091
8606
13012
3751
11597
8270
11518
8894
15258
5943
5280
9682
14830
3912
5028
14056
8666
16156
2922
8386
16305
10537
8029
4263
6302
8835
1965
14055
17671
10708
1356
6614
7333
22394
14443
15000
9155
7432
8828
13913
11864
11850
9971
2990
6715
12741
11992
8981
11740
17675
21010
15756
6243
9280
15879
7425
10934
4802
13894
7985
12513
5861
4996
6157
8833
7407
14422
7270
3261
9783
3865
14504
2293
17818
7002
12807
7367
8329
10245
10749
4433
9331
8336
1044
9528
14268
6106
5731
14389
9534
12487
12253
16472
10580
7947
5072
5277
5826
1997
16589
14050
2033
7550
11880
15019
11736
4623
11021
12818
13393
7092
8699
3644
7111
1863
2719
7594
12893
10448
8825
11945
4333
10461
5668
496
5186
5423
10742
16245
22200
5979
3065
11008
17895
8950
17855
23862
10661
654
12518
11773
16488
17971
8273
6613
12693
2997
9559
9602
13507
13772
5719
17547
16298
8680
8170
11632
8871
7261
20719
12980
5674
4788
9348
11194
5360
4551
7312
11495
14681
7886
8228
17224
4047
6318
20068
15993
10033
9078
3831
14172
6049
6694
16675
5398
8151
9913
11749
8176
7347
5612
8862
13982
3391
17797
6387
9504
9288
6914
12329
16100
15800
15224
9457
4906
11161
10129
2479
4349
8295
13485
4290
8105
660
11104
10449
3165
4469
9339
13537
13806
3696
5554
5181
5918
4692
7615
13044
10811
8704
22550
4029
9225
5025
12292
11828
12347
11563
4347
8809
2015
3462
10275
5767
5977
4904
10946
8517
4251
8375
9469
7303
3436
6228
13126
1742
7319
8769
7978
3114
14722
11491
733
4504
7332
17666
13905
6941
18033
6628
3764
1749
8702
10643
8154
8748
9174
7840
8007
16827
14328
4962
22374
3700
8030
9319
3238
4756
4481
14160
1703
6632
9351
3745
18749
9036
3518
11744
2012
21482
3685
17166
8895
17305
3297
3400
5759
10729
4396
3921
8537
14457
1191
14352
9575
7335
10010
9241
6698
17847
7857
3758
18850
6834
8199
4372
9200
11024
7977
13372
9614
17902
4555
4190
11484
10277
11713
10481
3980
13001
8426
6583
13805
1076
9843
10610
5507
12617
7524
9178
14853
5332
7339
11105
4379
4446
23899
12672
12500
2726
7831
7551
6931
11356
9966
5626
2781
13073
6685
14095
17883
24629
14472
10372
14349
10850
16108
3386
1204
14387
8519
5240
18405
11819
1262
7125
20758
7865
20620
8887
6041
10938
6368
7094
6432
4127
6353
8458
3734
8555
2228
14869
4488
10038
7597
15148
14883
10037
14587
10689
12049
9079
4142
8960
11405
8984
12673
16120
4841
12573
5286
22571
9247
11193
3629
7414
9143
12975
10215
9298
9439
6602
6233
15760
10344
4001
8055
15611
7638
3011
20132
4403
12405
1082
10165
3113
13579
14445
3725
10970
5781
9531
7544
13637
5377
19445
12709
6566
9839
13325
10260
8021
9567
4363
10882
12337
8676
5845
7376
7866
3566
6835
10960
9734
5820
5644
7385
4739
13401
4165
5485
4151
10723
8080
8056
14052
13995
11115
6520
25365
18647
12145
2619
13855
12411
8065
9390
9939
5698
5218
16140
10113
9447
17506
13585
11646
12283
11765
9269
11915
13002
12181
12099
15744
3888
12676
11699
11109
3355
9831
10919
8965
10844
5749
3392
8492
13185
13714
4515
14632
14922
12674
605
3191
5157
3933
4182
10520
10486
11226
5724
8406
13011
11163
14402
2934
14748
16514
4838
6193
11812
6010
6888
2822
14290
5981
3673
8638
4809
7796
12511
11843
8157
9258
6178
18684
9232
6829
11089
9761
1982
9089
4830
14250
2127
1957
3843
13623
5742
10974
6772
12176
2485
14109
9710
8661
4604
10575
22201
16079
17101
9810
18344
10589
9758
10925
3832
15810
11818
20463
10399
10407
11826
2790
10916
9653
3668
2958
6071
18961
7683
14136
10852
16782
7994
3870
5726
12870
10012
6199
5838
4619
10859
10871
13800
5783
27953
15460
16656
2733
10102
5879
4213
12798
13546
12912
10800
8026
5786
10508
2344
7747
13174
11414
10809
7548
12093
8410
11590
16035
6894
4276
12341
6414
19226
8491
9061
13508
13209
7427
14919
9745
7249
11031
5874
12797
10209
11888
13235
7923
1869
9168
2274
10590
7408
17235
8450
820
10357
9031
4090
7461
2709
17433
12028
19155
4432
2078
8381
2939
12226
12269
13563
9154
13899
11320
5151
17337
7993
15987
10238
11287
15755
21137
5927
14279
13445
8218
12881
774
8427
9395
11076
4526
9931
22003
4054
10865
23055
14882
12571
10632
7251
16530
2899
3425
11312
11102
21424
10402
1122
6771
4633
16701
9153
15476
8309
9353
12128
3226
7936
11423
1828
6898
4045
4508
14574
7130
10842
6257
7343
6560
12827
15590
15395
15903
12911
11291
7021
11013
3222
5564
18900
4398
10577
3349
15119
14332
9346
9725
12465
11417
17735
8751
11239
13608
6330
3472
12515
13400
18361
4999
18060
9043
12168
4712
6410
10410
9577
15704
11037
8112
15568
9305
12782
15245
9501
10940
6064
23308
5992
11451
13469
7913
3328
7156
11012
9364
6358
8969
9951
12669
15950
7239
8465
1558
9876
13783
5327
19429
6001
1783
2506
7080
11886
10517
13323
12363
13237
14669
13355
10608
1541
10626
10096
20787
3468
7028
8496
21990
17177
14602
11464
5565
11123
23976
8103
8627
18534
12100
17267
12834
3710
12584
23560
9114
10283
17523
15103
6726
11365
4315
8004
10352
7678
7198
10874
16270
6409
4334
8266
10558
7321
13849
23563
6774
11483
3810
12323
7961
6328
6470
23259
9594
9547
9009
9476
11982
10319
5002
6220
12981
4953
2083
8100
13511
15782
19294
10776
13154
2189
9846
12547
13754
16468
3120
11624
13910
5010
8528
22195
3174
13994
1630
4578
16907
11793
7137
19588
11846
10750
9593
22877
19370
14455
14374
8348
5484
4084
11904
13954
11475
21377
19729
4305
3890
21820
7012
14061
21047
13943
7737
16236
5291
8800
2326
7845
5677
13911
8533
11984
13535
9563
16339
11132
9508
6400
2413
13374
9851
10224
7687
17308
18731
6608
5682
3180
9771
16780
5055
11698
6415
7895
18074
25590
14684
8755
18337
2052
3573
12969
9826
11560
8696
13097
23948
8770
15441
15490
6180
14725
7291
16466
7241
10019
19988
4077
2058
11968
5493
7556
5289
5607
13597
5177
5328
7212
16325
4848
19076
5167
3401
4498
9678
12961
12851
19699
11959
6545
4747
9899
15888
4608
7756
16959
9584
12410
11147
12973
21778
8363
18551
13674
2325
4799
11746
17466
10222
15910
8837
1062
10957
10075
14850
10530
11871
14742
6997
6940
1587
7517
10982
5736
4702
3337
9835
7989
7128
6770
15219
6717
24737
6182
14745
13717
13159
3795
5561
7348
15855
8355
21076
18716
8814
7132
13173
10468
5822
4057
8667
21715
9015
6125
12084
11107
6659
7769
13275
13481
10771
9736
5163
6653
13661
9517
4293
5425
668
8311
15302
4614
15658
16150
9388
5606
6713
14498
10031
20129
4373
3704
9976
12737
5189
13362
9500
15696
9456
11447
15941
4601
8378
8608
13351
13426
8173
14741
15720
11158
13655
14228
21282
13551
3106
19023
5821
15128
10406
18854
6240
3110
5636
8194
13647
21964
23312
2624
701
11858
10086
14806
4453
18874
12317
9793
9654
13682
5663
18794
17052
14280
11552
15013
9349
4851
7455
8703
23038
23106
14227
4592
14179
8557
11520
9488
7200
7862
11655
18497
19184
17811
5000
11692
8924
6128
16119
11763
3800
10899
11682
9369
12420
14685
11567
9423
20898
6576
11314
14059
8464
11001
19200
13147
5304
6497
3664
1975
5916
6255
4130
19742
15520
12545
10241
13621
15828
12435
5017
16402
12826
8580
22323
5610
7650
12130
15734
5148
13919
9756
14648
7242
13890
22392
5920
13202
9387
14404
3244
6702
13345
8206
7928
9538
16631
18651
8939
9492
6769
9651
9632
9666
1663
12380
11306
12154
14276
2883
10922
7167
3389
20852
11304
6514
9130
4784
20269
17881
17541
13504
2919
6655
11203
11069
3128
23495
6887
7980
9746
14353
10460
5598
6232
1406
7973
12172
9671
10116
7093
14481
19487
10298
9120
13509
3035
19725
19878
15899
1754
21458
14344
11434
11270
14370
15845
8936
7396
19357
8603
11845
12902
7837
11200
17005
1708
5241
8140
15517
6018
14780
3796
2253
11767
12841
4698
2948
18160
7656
19134
8385
18517
15863
13004
15750
1755
7618
7462
13825
10089
22649
20080
10156
8635
11498
22967
10534
13613
11711
5645
13072
24736
23620
11725
13019
8473
9309
4036
6262
10295
4232
8023
13970
2186
6480
13305
2486
6676
9132
18790
19330
6951
12308
17519
12339
22294
11321
18556
932
13600
9572
22483
2201
5044
14423
13332
15990
13109
15478
5235
5999
6913
7050
14195
10235
10582
17626
22414
10542
13846
7540
17346
14682
6588
11780
13250
13798
8971
21140
6420
22212
15688
4863
15214
11137
2847
16175
14820
9940
5520
18448
5580
6489
21351
1845
12563
2151
15707
7147
13639
16404
8074
5998
19926
16240
5873
8953
12038
18981
14206
4431
18736
16855
18743
23884
12549
6998
16943
12336
9240
16770
10216
11241
13258
22808
23144
16967
6577
6235
15596
7400
6505
15276
12385
16730
21921
16602
11878
5945
2811
2262
4701
7922
8583
8350
15621
8039
12530
2836
14915
20994
11032
12836
195
8193
10879
15593
13245
6134
15087
9002
18681
13471
13789
7182
15033
14006
7905
14291
5582
1214
15102
22657
2563
15949
14266
8024
18411
12153
13264
6521
5685
13955
12437
9381
5040
16001
12281
7648
16982
3632
13758
3310
3379
20340
2266
13373
11808
19424
12726
7917
14169
13060
20154
13908
25159
17278
10473
5950
6416
2977
14677
18966
18248
11435
14377
7452
5654
15648
15415
13296
3046
8468
1156
2095
20826
4310
13279
19530
12942
15542
11011
13329
13891
8221
5018
14526
11958
5263
12701
12859
12299
14388
13285
8996
16258
7864
4828
10201
6640
10785
14947
11712
17171
14652
15806
22166
9485
23404
10895
15901
11340
13125
4439
13110
11856
13738
14710
10310
23650
12635
3717
20932
14762
2551
5697
10570
9812
13498
8068
7399
13057
10423
10250
8941
11259
10747
11490
24716
14242
8502
9373
8695
9520
6641
10227
16225
11293
11486
15841
18507
14014
18250
6873
9762
18822
13594
3487
16135
9127
5106
8760
10169
11285
10573
18398
9625
14585
26641
11689
2385
12636
8438
10240
7960
18270
6259
4060
13286
18618
18166
7416
14881
2526
10645
11570
10631
8840
14117
11098
7723
9403
11388
5102
21871
9967
5530
22990
13707
12003
7144
17488
15317
8152
15372
4335
10939
7557
10178
8736
22463
23421
21069
14009
16872
6354
14450
13948
22076
8619
12592
4306
4970
17569
11204
7207
6351
8616
8497
7052
8230
17619
11830
15328
23154
4196
15150
13375
6908
12495
12412
8095
3999
8550
12847
8529
11260
5835
10309
14313
18493
8196
7370
7441
10208
12224
6260
7573
15909
18395
4583
24507
23776
7884
9658
12358
9889
13444
9747
19825
11924
391
5094
8743
12101
24182
5699
23782
6546
14148
6265
8926
19841
5957
16242
9643
9229
4406
17444
16687
7811
4048
14204
18378
6458
7672
14265
11159
18176
10311
13726
10321
8354
20576
11369
12585
5205
9357
14127
1418
11113
6928
10051
6477
5063
18216
4811
19053
11419
3423
21015
7415
19989
7896
16138
11681
13638
6251
22507
7175
2925
10111
5789
12403
13831
268
15759
7121
23554
16006
15118
1797
11851
11323
20325
1917
9164
1992
11316
6624
10541
24463
18447
14959
8566
11615
9681
13324
25035
10986
14194
6948
7346
14237
21829
7491
11938
6295
23979
23752
2200
11799
23659
7992
10909
14292
7981
25868
4354
14283
4629
20028
13446
10692
3756
9306
12143
16691
13370
15193
22817
12803
13265
5182
11231
10177
18502
17325
11516
15334
11106
10174
7023
11099
7161
7046
17164
16098
4509
13479
6143
19846
11539
11463
6986
13704
20626
10294
6175
19626
3443
4512
9732
5217
16895
9063
19460
13357
3900
14976
12089
14862
14518
7071
8248
13368
15947
7848
18622
15705
11627
11478
6058
16500
14622
20570
11149
8174
8087
19564
3744
13468
16729
22137
8633
13423
11974
11576
8553
7839
18685
15402
6023
14939
10393
22805
25558
6494
4850
15002
14365
2426
9617
11550
12761
9648
13741
10403
13025
15867
6995
11350
15319
19996
14916
10603
13863
13055
13778
2100
11522
10422
9354
7753
13152
15558
22828
11141
12951
11336
10081
14600
13206
18205
10139
13667
18811
18417
2903
15401
14448
19974
16717
7643
23329
4765
7305
6939
18113
5414
20745
12116
16037
4112
10206
14079
20960
9958
5848
7087
4990
8429
15179
5301
14540
14297
12751
14963
22729
15408
8081
13394
5714
12119
2911
10066
5556
10292
12703
22330
12457
17551
19527
11093
13340
15966
10299
22816
3981
15516
18698
16981
11598
10660
8851
10381
22456
15738
11647
9884
25342
22937
8286
4943
11910
4842
18818
7673
15265
14110
18368
10248
17124
8169
10068
15421
7433
15275
15174
12752
3926
16745
10954
11169
7542
13418
7988
18418
8679
3606
22248
3449
4655
15254
22209
15574
8988
9411
10053
3053
18595
23804
11248
3605
7496
1439
4771
17668
17045
3107
3140
15508
25861
4346
8052
11238
12492
16919
11450
6096
11324
22663
14744
5482
11188
3388
3624
8945
23354
9237
12061
4877
27993
9109
2653
490
17465
9850
12023
13820
14493
10300
1458
23054
6877
5175
22063
18932
16477
8724
22746
10155
9744
12697
12384
13437
4069
14264
7854
4939
2512
5529
10783
4487
15952
14736
7070
4715
11000
6860
6650
8301
23825
2147
8163
10748
4669
8975
14357
10741
15316
16033
19847
8884
8853
21151
11223
16708
12819
19935
22095
17383
6076
10026
8925
11569
15681
13322
12044
21202
16423
6844
18082
10999
16980
17211
15009
11612
10815
13807
17178
6209
22671
8175
11168
6065
3506
22731
5128
16692
9207
14062
13848
9267
4708
15711
13785
8072
11064
14747
11517
12614
10126
16595
4100
25294
18819
12438
9077
3319
15728
17772
15281
13969
5811
21408
9422
4311
21895
9749
10286
5548
16461
15655
4138
13304
12820
9573
11769
10259
7727
12792
10079
15506
12080
22821
11642
12126
26169
7655
14057
24298
8413
23851
5888
10219
9915
15594
7632
26301
7377
17001
15166
6679
9417
387
6407
22131
4950
14683
15739
5029
10618
15420
22141
11461
1695
17212
17526
25660
8327
7726
22105
16831
638
4123
15573
17799
10332
10887
11401
11996
22950
24439
10190
16162
6989
7379
8171
12191
5169
19971
8195
3836
19311
6466
26705
12171
8542
9495
18334
19835
9029
11660
17679
25540
6637
7324
2942
5262
9813
13269
5814
2180
16540
15394
19329
5234
4499
17401
3413
13482
10044
9486
9028
7513
7361
9691
23810
9301
11116
5595
12952
628
14531
7146
5514
12050
19083
4587
14730
16860
17839
11230
9402
8504
18481
13792
15375
17148
17635
16612
6850
6994
11500
9442
6590
13015
7699
5141
8371
15684
10164
21672
6503
8280
8037
16673
12780
5576
16688
14957
6740
23034
14383
7219
10535
17283
7899
16714
14708
19003
18399
4733
17828
10199
9003
15176
17516
23050
11004
6029
21441
12121
23039
15615
11245
11219
9382
14340
15669
9421
6762
23578
10738
10149
2767
16753
13896
12067
16410
17530
2086
13023
18648
10599
22448
22153
4649
20293
9236
3854
12641
22390
12090
16368
8783
13607
11331
17261
15231
7690
3305
16639
6485
17476
8209
2674
7217
6856
16018
12063
16379
11266
769
19956
10634
8772
7717
10303
11444
20538
11688
7417
8198
7889
13565
7610
12370
6900
13450
9849
7154
4434
19965
4211
11536
15505
11256
10814
9596
13737
12059
3477
12711
11246
12885
7736
23215
21122
2941
13069
13989
14203
3579
12512
18575
17195
167
9647
6977
15361
10949
15229
12486
10568
13007
14659
20004
9001
12646
16853
7254
17648
8914
4266
7091
10808
8979
4094
16047
12264
10458
7058
6833
8803
6917
4459
20136
10569
26037
11453
16603
10731
8767
10304
19376
12604
7552
14801
8636
17870
20241
14359
2393
10893
21744
25553
5583
8032
14236
10624
16255
6159
12853
5338
7373
24006
14078
3691
10595
16542
17295
16697
15722
13030
10947
7582
14743
6657
10856
14028
11420
20377
23913
11086
12845
10583
14112
8126
14277
10307
9663
13330
11730
16553
11644
6205
10697
10427
2910
18282
16748
6055
15069
7863
12426
13346
9198
6551
18092
19260
12955
2271
15266
5828
24637
5584
10469
7162
5212
11229
11019
9506
11951
15468
18444
10070
2312
3947
12418
13495
10905
15900
20476
8558
9384
14143
11633
19276
12131
8141
7773
9338
14604
14718
5421
14454
6819
9750
7502
8923
7487
17876
15622
2644
19196
13984
17859
10604
14693
13326
6453
6430
14844
16153
6863
13999
19791
19733
9701
9936
15332
17865
16409
9012
869
9974
22434
7803
910
17351
27883
17432
10621
15638
9004
11341
5412
12750
14876
8443
4621
14083
14924
6990
8146
17036
13763
15902
25958
16407
6895
8516
11706
13748
11068
21081
12019
12400
19581
5750
11403
5370
19297
8534
11114
10143
10635
2378
6327
15591
17402
23746
5643
8734
9134
8543
13769
14975
14189
9048
4147
7384
25611
9928
14086
2960
9416
